package com.cherkina.student_planner.data

data class Subject(
    val id: String,
    val name: String,
    val professor: String,
    val credits:Int,
    val currentGrade: String,
    val description: String
)
val sampleSubjects= listOf(
    Subject(
        id = "1",
        name = "Разработка мобильных приложений",
        professor = "Леонтьев Д.А.",
        credits = 91,
        currentGrade = "Отлично",
        description = "Разработка нативных Android-приложений с использованием Kotlin и современных компонентов Jetpack Compose. Изучение архитектурных паттернов MVVM, работы с локальными базами данных и сетевыми API."
    ),
    Subject(
        id = "3",
        name = "Системное программирование",
        professor = "Токаев Т.И.",
        credits = 75,
        currentGrade = "Хорошо",
        description = "Низкоуровневая разработка на языке Rust: управление памятью без сборщика мусора, многопоточность, работа с операционной системой и создание высокопроизводительных системных компонентов."
    ),
    Subject(
        id = "3",
        name = "Физическая культура",
        professor = "Магомедов С. К",
        credits = 100,
        currentGrade = "Отлично",
        description = "Развитие физических качеств, укрепление здоровья и поддержание работоспособности."
    ),
    Subject(
        id = "4",
        name = "Иностранный язык в профессиональной деятельности",
        professor = "Пенькова О. В",
        credits = 99,
        currentGrade = "Отлично",
        description = "Изучение профессиональной лексики и грамматики английского языка для работы в IT."
    ),
    Subject(
        id = "5",
        name = "Производственная практика",
        professor = "Цыганкова М. Л",
        credits = 100,
        currentGrade = "Отлично",
        description = "Участие в реальной разработке, анализ требований и подготовка отчёта с защитой."
    ),
    Subject(
        id = "6",
        name = "Менеджмент в профессиональной деятельности",
        professor = "Запорожская С. А",
        credits = 91,
        currentGrade = "Отлично",
        description = "Основы управления проектами и командой."
    ),
    Subject(
        id = "7",
        name = "Разработка программных модулей",
        professor = "Донскова Д. А",
        credits = 93,
        currentGrade = "Отлично",
        description = "Разработка и тестирование модулей программного обеспечения с применением ООП и популярных паттернов проектирования."
    ),
    Subject(
        id = "8",
        name = "Управление проектами",
        professor = "Трошина О. В",
        credits = 91,
        currentGrade = "Отлично",
        description = "Составление технических заданий и контроль сроков проекта."
    ),
    Subject(
        id = "9",
        name = "Математическое моделирование",
        professor = "Трошина О. В",
        credits = 98,
        currentGrade = "Отлично",
        description = "Построение математических моделей для решения задач анализа данных и принятия решений в информационных системах."
    ),
    Subject(
        id = "10",
        name = "Инструментальные средства разработки программного обеспечения",
        professor = "Леонтьев Д. А",
        credits = 92,
        currentGrade = "Отлично",
        description = "Работа с Git и IDLE, отладка и профилирование приложений, автоматизированное тестирование."
    ),
    Subject(
        id = "11",
        name = "Обеспечение качества функционирования компьютерных систем",
        professor = "Ушакова М. А",
        credits = 97,
        currentGrade = "Отлично",
        description = "Методы тестирования ПО, стандарты качества, обеспечение надёжности и безопасности компьютерных систем."
    )
)